ARMmbed/mbed-os/features/FEATURE_BLE/targets/TARGET_STM/TARGET_NUCLEO_WB55RG/stm32wb_HCIDriver.cpp
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t HciAclDataBuffer[MAX_HCI_ACL_PACKET_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t     SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t     BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];


/**
 * Cordio HCI driver factory
 */
ble::vendor::cordio::CordioHCIDriver& ble_cordio_get_hci_driver() {
    static ble::vendor::stm32wb::TransportDriver transport_driver(
            &BleCmdBuffer,
            &SystemCmdBuffer,
            EvtPool,
            SystemSpareEvtBuffer,
            BleSpareEvtBuffer,
            HciAclDataBuffer
    );

    static ble::vendor::stm32wb::HCIDriver hci_driver (
        transport_driver /* other hci driver parameters */
    );

    return hci_driver;
}

static void evt_received(TL_EvtPacket_t *hcievt) {
    uint16_t len = 0;

    // We need to memcpy the data before passing to higher layers.
    switch (hcievt->evtserial.type) {
        case TL_BLEEVT_PKT_TYPE:
            len = hcievt->evtserial.evt.plen + TL_EVT_HDR_SIZE;
            ble::vendor::stm32wb::TransportDriver::on_data_received((uint8_t *)&hcievt->evtserial, len);
            break;
        case TL_ACL_DATA_PKT_TYPE:
            {
            TL_AclDataSerial_t *acl = &(((TL_AclDataPacket_t *)hcievt)->AclDataSerial);
            len = acl->length + 5;
            ble::vendor::stm32wb::TransportDriver::on_data_received((uint8_t *)acl, len);
            }
            break;
        default:
            // should not happen - let's block to check
            tr_error("BLE TL evt_received, wrong type:%d \r\n");
            break;
    }

    /*  In case Event belongs to the Evt Pool we need to inform  */
    if (((uint8_t*)hcievt >= EvtPool) && ((uint8_t*)hcievt < (EvtPool + POOL_SIZE))) {
            /*  Free the message from shared memory */
            TL_MM_EvtDone(hcievt);
    }
}

/**
 * TL Mailbox synchronisation means
 */

/* Using Semaphore to implemented blocking cmd/resp on system channel */
static rtos::Semaphore sys_event_sem(0, 1);
static rtos::Semaphore sys_resp_sem(0, 1);
static rtos::Semaphore acl_ack_sem(1, 1);

static void acl_data_ack(void) {
  /**
   * The current implementation assumes the tackGUI will not send a new HCI ACL DATA packet before this ack is received
   * ( which means the CPU2 has handled the previous packet )
   * In order to implement a secure mechanism, it is required either
   * - a flow control with the stack
   * - a local pool of buffer to store packets received from the stack
   */
  acl_ack_sem.release();
  return;
}

static bool acl_data_wait(void) {

    /* Wait 10 sec for previous ACL command to be ack'ed by Low Layers
     * before sending the next one */
    if(acl_ack_sem.wait(10000) < 1) {
        return false;
    } else {
        return true;
    }
}

/*  WEAK callbacks from the BLE TL driver - will be called under Interrupt */
static void sysevt_received( void* pdata) {
    /* For now only READY event is received, so we know this is it */
    sys_event_sem.release();
    /* But later on ... we'll have to parse the answer */
    return;
 }

/*  returns true if ssyevt was received, false otherwise */
static bool sysevt_wait( void) {
    /*  Wait for 10sec max - if not return an error */
    if(sys_event_sem.wait(10000) < 1) {
        return false;
    } else {
        /*  release immmediately, now that M0 runs */
        sys_event_sem.release();
        return true;
    }
}

/*  returns true if ssyevt was already received, which means M0 core is
 *  already up and running */
static bool sysevt_check( void) {
    /*  Check if system is UP and runing already */
    if(sys_event_sem.wait(10) < 1) {
        return false;
    } else {
        /*  release immmediately as M0 already runs */
        sys_event_sem.release();
        return true;
    }
}

static void syscmd_status_not( SHCI_TL_CmdStatus_t status ) {
  tr_debug("syscmd_status_not, status:%d\r\n", status);
  return;
}

void shci_notify_asynch_evt(void* pdata) {
  /* Need to parse data in future version */
  shci_user_evt_proc();
  return;
}

void shci_cmd_resp_release(uint32_t flag) {
  sys_resp_sem.release();
  return;
}

void shci_cmd_resp_wait(uint32_t timeout) {
  /* TO DO: manage timeouts if we can return an error */
  if(sys_resp_sem.wait(timeout) < 1) {
        tr_error("shci_cmd_resp_wait timed out\r\n");
  }
}

void shci_register_io_bus(tSHciIO* fops) {
  /* Register IO bus services */
  fops->Init    = TL_SYS_Init;
  fops->Send    = TL_SYS_SendCmd;
}

/**
 * Few utilities functions
 */
static void init_debug( void ) {
    tr_debug("WB init_debug: ");
/* In case of MBED debug profile, configure debugger support */
#if (defined(MBED_DEBUG) || (CFG_DEBUGGER_SUPPORTED == 1))
    /**
	 * Keep debugger enabled while in any low power mode
	 */
	HAL_DBGMCU_EnableDBGSleepMode();
	HAL_DBGMCU_EnableDBGStopMode();
	HAL_DBGMCU_EnableDBGStandbyMode();

	/***************** ENABLE DEBUGGER *************************************/
	LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);
	LL_C2_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);

#else
    tr_debug("DISABLED\r\n");

	GPIO_InitTypeDef gpio_config = {0};

	gpio_config.Pull = GPIO_NOPULL;
	gpio_config.Mode = GPIO_MODE_ANALOG;

	gpio_config.Pin = GPIO_PIN_15 | GPIO_PIN_14 | GPIO_PIN_13;
	__HAL_RCC_GPIOA_CLK_ENABLE();
	HAL_GPIO_Init(GPIOA, &gpio_config);

	gpio_config.Pin = GPIO_PIN_4 | GPIO_PIN_3;
	__HAL_RCC_GPIOB_CLK_ENABLE();
	HAL_GPIO_Init(GPIOB, &gpio_config);

	HAL_DBGMCU_DisableDBGSleepMode();
	HAL_DBGMCU_DisableDBGStopMode();
	HAL_DBGMCU_DisableDBGStandbyMode();

#endif /* (CFG_DEBUGGER_SUPPORTED == 1) */

	return;
}

/* This function fills in a BD address table */
bool get_bd_address( uint8_t* bd_addr ) {
    uint8_t *otp_addr;
    uint32_t udn;
    uint32_t company_id;
    uint32_t device_id;
    bool bd_found;

    udn = LL_FLASH_GetUDN();

    if(udn != 0xFFFFFFFF) {
        tr_debug("Found UDN: 0x%8lX\r\n", udn);

        company_id = LL_FLASH_GetSTCompanyID();
        device_id = LL_FLASH_GetDeviceID();

        bd_addr[0] = (uint8_t)(udn & 0x000000FF);
        bd_addr[1] = (uint8_t)( (udn & 0x0000FF00) >> 8 );
        bd_addr[2] = (uint8_t)( (udn & 0x00FF0000) >> 16 );
        bd_addr[3] = (uint8_t)device_id;
        bd_addr[4] = (uint8_t)(company_id & 0x000000FF);
        bd_addr[5] = (uint8_t)( (company_id & 0x0000FF00) >> 8 );

        bd_found = true;
    } else {
        otp_addr = OTP_Read(0);
        if(otp_addr) {
            memcpy(bd_addr, ((OTP_ID0_t*)otp_addr)->bd_address, CONFIG_DATA_PUBADDR_LEN);
            bd_found = false;
        } else {
            tr_debug("Cannot find BD ADDRESS to program - will leave hw default\r\n");
            bd_found = true;
        }
    }

    return bd_found;
}

